Repository: GMaup/website
Catalog: translations/security.*.xlf
Languages: fa

source: An authentication exception occurred.
fa: خطایی هنگام احراز هویت رخ داده است.

source: Authentication credentials could not be found.
fa: شرایط احراز هویت یافت نشد.

source: Authentication request could not be processed due to a system problem.
fa: درخواست احراز هویت به دلیل وجود مشکل در سیستم قابل پردازش نمی باشد.

source: Invalid credentials.
fa: احراز هویت نامعتبر می باشد.

source: Cookie has already been used by someone else.
fa: Cookie قبلا توسط شخص دیگری استفاده گردیده است.

source: Not privileged to request the resource.
fa: دسترسی لازم برای درخواست از این منبع را دارا نمی باشید.

source: Invalid CSRF token.
fa: توکن CSRF معتبر نمی باشد.

source: No authentication provider found to support the authentication token.
fa: هیچ ارایه دهنده احراز هویتی برای پشتیبانی از توکن احراز هویت پیدا نشد.

source: No session available, it either timed out or cookies are not enabled.
fa: هیچ جلسه‌ای در دسترس نمی باشد. این میتواند به دلیل پایان یافتن زمان و یا فعال نبودن کوکی ها باشد.

source: No token could be found.
fa: هیچ توکنی پیدا نشد.

source: Username could not be found.
fa: نام ‌کاربری پیدا نشد.

source: Account has expired.
fa: حساب کاربری منقضی گردیده است.

source: Credentials have expired.
fa: مجوزهای احراز هویت منقضی گردیده‌اند.

source: Account is disabled.
fa: حساب کاربری غیرفعال می باشد.

source: Account is locked.
fa: حساب کاربری قفل گردیده است.

source: Too many failed login attempts, please try again later.
fa: تلاش‌های ناموفق زیادی برای ورود صورت گرفته است، لطفاً بعداً دوباره تلاش کنید.

source: Invalid or expired login link.
fa: لینک ورود نامعتبر یا تاریخ‌گذشته است.

source: Too many failed login attempts, please try again in %minutes% minute.
fa: تلاش‌های ناموفق زیادی برای ورود صورت گرفته است، لطفاً %minutes% دقیقه دیگر دوباره امتحان کنید.

source: Too many failed login attempts, please try again in %minutes% minutes.
fa: تلاش‌های ناموفق زیادی برای ورود صورت گرفته است، لطفاً %minutes% دقیقه دیگر دوباره امتحان کنید.
