Repository: GMaup/website
Catalog: translations/validators.*.xlf
Languages: ar

source: This value should be false.
ar: هذه القيمة يجب أن تكون خاطئة.

source: This value should be true.
ar: هذه القيمة يجب أن تكون حقيقية.

source: This value should be of type {{ type }}.
ar: هذه القيمة يجب ان تكون من نوع {{ type }}.

source: This value should be blank.
ar: هذه القيمة يجب ان تكون فارغة.

source: The value you selected is not a valid choice.
ar: القيمة المختارة ليست خيارا صحيحا.

# 0d999f2
source: You must select at least {{ limit }} choice.|You must select at least {{ limit }} choices.
ar: يجب ان تختار {{ limit }} اختيار على الاقل.|يجب ان تختار {{ limit }} اختيار على الاقل.|يجب ان تختار {{ limit }} اختيارات على الاقل.|يجب ان تختار {{ limit }} اختيار على الاقل.|يجب ان تختار {{ limit }} اختيار على الاقل.|يجب ان تختار {{ limit }} اختيار على الاقل.

source: You must select at most {{ limit }} choice.|You must select at most {{ limit }} choices.
ar: يجب ان تختار {{ limit }} اختيار على الاكثر.|يجب ان تختار {{ limit }} اختيار على الاكثر.|يجب ان تختار {{ limit }} اختيارات على الاكثر.|يجب ان تختار {{ limit }} اختيار على الاكثر.|يجب ان تختار {{ limit }} اختيار على الاكثر.|يجب ان تختار {{ limit }} اختيار على الاكثر.

source: One or more of the given values is invalid.
ar: واحد أو أكثر من القيم المعطاه خاطئ.

source: This field was not expected.
ar: لم يكن من المتوقع هذا المجال.

source: This field is missing.
ar: هذا المجال مفقود.

source: This value is not a valid date.
ar: هذه القيمة ليست تاريخا صالحا.

source: This value is not a valid datetime.
ar: هذه القيمة ليست تاريخا و وقتا صالحا.

source: This value is not a valid email address.
ar: هذه القيمة ليست عنوان بريد إلكتروني صحيح.

source: The file could not be found.
ar: لا يمكن العثور على الملف.

source: The file is not readable.
ar: الملف غير قابل للقراءة.

# 1ad411a
source: The file is too large ({{ size }} {{ suffix }}). Allowed maximum size is {{ limit }} {{ suffix }}.
ar: الملف كبير جدا ({{ size }} {{ suffix }}).اقصى مساحه مسموح بها ({{ limit }} {{ suffix }}).

# 30a318d
source: The mime type of the file is invalid ({{ type }}). Allowed mime types are {{ types }}.
ar: نوع الملف غير صحيح ({{ type }}). الانواع المسموح بها هى {{ types }}.

source: This value should be {{ limit }} or less.
ar: هذه القيمة يجب ان تكون {{ limit }} او اقل.

# 0e0c1e1
source: This value is too long. It should have {{ limit }} character or less.|This value is too long. It should have {{ limit }} characters or less.
ar: هذه القيمة طويلة جدا. يجب ان تكون {{ limit }} حرف او اقل.|هذه القيمة طويلة جدا. يجب ان تكون {{ limit }} حرف او اقل.|هذه القيمة طويلة جدا. يجب ان تكون {{ limit }} حروف او اقل.|هذه القيمة طويلة جدا. يجب ان تكون {{ limit }} حرف او اقل.|هذه القيمة طويلة جدا. يجب ان تكون {{ limit }} حرف او اقل.|هذه القيمة طويلة جدا. يجب ان تكون {{ limit }} حرف او اقل.

source: This value should be {{ limit }} or more.
ar: هذه القيمة يجب ان تكون {{ limit }} او اكثر.

# 5188ff9
source: This value is too short. It should have {{ limit }} character or more.|This value is too short. It should have {{ limit }} characters or more.
ar: هذه القيمة قصيرة جدا. يجب ان تكون {{ limit }} حرف او اكثر.|هذه القيمة قصيرة جدا. يجب ان تكون {{ limit }} حرف او اكثر.|هذه القيمة قصيرة جدا. يجب ان تكون {{ limit }} حروف او اكثر.|هذه القيمة قصيرة جدا. يجب ان تكون {{ limit }} حرف او اكثر.|هذه القيمة قصيرة جدا. يجب ان تكون {{ limit }} حرف او اكثر.|هذه القيمة قصيرة جدا. يجب ان تكون {{ limit }} حرف او اكثر.

source: This value should not be blank.
ar: هذه القيمة يجب الا تكون فارغة.

source: This value should not be null.
ar: هذه القيمة يجب الا تكون فارغة.

source: This value should be null.
ar: هذه القيمة يجب ان تكون فارغة.

source: This value is not valid.
ar: هذه القيمة غير صحيحة.

source: This value is not a valid time.
ar: هذه القيمة ليست وقت صحيح.

source: This value is not a valid URL.
ar: هذه القيمة ليست رابط الكترونى صحيح.

source: The two values should be equal.
ar: القيمتان يجب ان تكونا متساويتان.

source: The file is too large. Allowed maximum size is {{ limit }} {{ suffix }}.
ar: الملف كبير جدا. اقصى مساحه مسموح بها {{ limit }} {{ suffix }}.

source: The file is too large.
ar: الملف كبير جدا.

source: The file could not be uploaded.
ar: لم استطع استقبال الملف.

source: This value should be a valid number.
ar: هذه القيمة يجب ان تكون رقم.

source: This file is not a valid image.
ar: هذا الملف ليس صورة صحيحة.

source: This is not a valid IP address.
ar: هذه القيمة ليست عنوان رقمى صحيح.

source: This value is not a valid language.
ar: هذه القيمة ليست لغة صحيحة.

source: This value is not a valid locale.
ar: هذه القيمة ليست موقع صحيح.

source: This value is not a valid country.
ar: هذه القيمة ليست بلدا صالحا.

source: This value is already used.
ar: هذه القيمة مستخدمة بالفعل.

source: The size of the image could not be detected.
ar: لم استطع معرفة حجم الصورة.

# 266051e
source: The image width is too big ({{ width }}px). Allowed maximum width is {{ max_width }}px.
ar: عرض الصورة كبير جدا ({{ width }}px). اقصى عرض مسموح به هو{{ max_width }}px.

# c1c23f9
source: The image width is too small ({{ width }}px). Minimum width expected is {{ min_width }}px.
ar: عرض الصورة صغير جدا ({{ width }}px). اقل عرض مسموح به هو{{ min_width }}px.

# 9a128f7
source: The image height is too big ({{ height }}px). Allowed maximum height is {{ max_height }}px.
ar: طول الصورة كبير جدا ({{ height }}px). اقصى طول مسموح به هو{{ max_height }}px.

# 8a4cd70
source: The image height is too small ({{ height }}px). Minimum height expected is {{ min_height }}px.
ar: طول الصورة صغير جدا ({{ height }}px). اقل طول مسموح به هو{{ min_height }}px.

source: This value should be the user's current password.
ar: هذه القيمة يجب ان تكون كلمة سر المستخدم الحالية.

# fd389d6
source: This value should have exactly {{ limit }} character.|This value should have exactly {{ limit }} characters.
ar: هذه القيمة يجب ان تحتوى على {{ limit }} حرف فقط.|هذه القيمة يجب ان تحتوى على {{ limit }} حرف فقط.|هذه القيمة يجب ان تحتوى على {{ limit }} حروف فقط.|هذه القيمة يجب ان تحتوى على {{ limit }} حرف فقط.|هذه القيمة يجب ان تحتوى على {{ limit }} حرف فقط.|هذه القيمة يجب ان تحتوى على {{ limit }} حرف فقط.

source: The file was only partially uploaded.
ar: تم استقبال جزء من الملف فقط.

source: No file was uploaded.
ar: لم يتم ارسال اى ملف.

source: No temporary folder was configured in php.ini.
ar: لم يتم تهيئة حافظة مؤقتة فى ملف php.ini.

source: Cannot write temporary file to disk.
ar: لم استطع كتابة الملف المؤقت.

source: A PHP extension caused the upload to fail.
ar: احد اضافات PHP تسببت فى فشل استقبال الملف.

# b54c218
source: This collection should contain {{ limit }} element or more.|This collection should contain {{ limit }} elements or more.
ar: هذه المجموعة يجب ان تحتوى على {{ limit }} عنصر او اكثر.|هذه المجموعة يجب ان تحتوى على {{ limit }} عنصر او اكثر.|هذه المجموعة يجب ان تحتوى على {{ limit }} عناصر او اكثر.|هذه المجموعة يجب ان تحتوى على {{ limit }} عنصر او اكثر.|هذه المجموعة يجب ان تحتوى على {{ limit }} عنصر او اكثر.|هذه المجموعة يجب ان تحتوى على {{ limit }} عنصر او اكثر.

# 949632c
source: This collection should contain {{ limit }} element or less.|This collection should contain {{ limit }} elements or less.
ar: هذه المجموعة يجب ان تحتوى على {{ limit }} عنصر او اقل.|هذه المجموعة يجب ان تحتوى على {{ limit }} عنصر او اقل.|هذه المجموعة يجب ان تحتوى على {{ limit }} عناصر او اقل.|هذه المجموعة يجب ان تحتوى على {{ limit }} عنصر او اقل.|هذه المجموعة يجب ان تحتوى على {{ limit }} عنصر او اقل.|هذه المجموعة يجب ان تحتوى على {{ limit }} عنصر او اقل.

# e0582dc
source: This collection should contain exactly {{ limit }} element.|This collection should contain exactly {{ limit }} elements.
ar: هذه المجموعة يجب ان تحتوى على {{ limit }} عنصر فقط.|هذه المجموعة يجب ان تحتوى على {{ limit }} عنصر فقط.|هذه المجموعة يجب ان تحتوى على {{ limit }} عناصر فقط.|هذه المجموعة يجب ان تحتوى على {{ limit }} عنصر فقط.|هذه المجموعة يجب ان تحتوى على {{ limit }} عنصر فقط.|هذه المجموعة يجب ان تحتوى على {{ limit }} عنصر فقط.

source: Invalid card number.
ar: رقم البطاقه غير صحيح.

source: Unsupported card type or invalid card number.
ar: نوع البطاقه غير مدعوم او الرقم غير صحيح.

source: This is not a valid International Bank Account Number (IBAN).
ar: الرقم IBAN (رقم الحساب المصرفي الدولي) الذي تم إدخاله غير صالح.

source: This value is not a valid ISBN-10.
ar: هذه القيمة ليست ISBN-10 صالحة.

source: This value is not a valid ISBN-13.
ar: هذه القيمة ليست ISBN-13 صالحة.

source: This value is neither a valid ISBN-10 nor a valid ISBN-13.
ar: هذه القيمة ليست ISBN-10 صالحة ولا ISBN-13 صالحة.

source: This value is not a valid ISSN.
ar: هذه القيمة ليست ISSN صالحة.

source: This value is not a valid currency.
ar: العُملة غير صحيحة.

source: This value should be equal to {{ compared_value }}.
ar: القيمة يجب ان تساوي {{ compared_value }}.

source: This value should be greater than {{ compared_value }}.
ar: القيمة يجب ان تكون اعلي من {{ compared_value }}.

source: This value should be greater than or equal to {{ compared_value }}.
ar: القيمة يجب ان تكون مساوية او اعلي من {{ compared_value }}.

source: This value should be identical to {{ compared_value_type }} {{ compared_value }}.
ar: القيمة يجب ان تطابق {{ compared_value_type }} {{ compared_value }}.

source: This value should be less than {{ compared_value }}.
ar: القيمة يجب ان تكون اقل من {{ compared_value }}.

source: This value should be less than or equal to {{ compared_value }}.
ar: القيمة يجب ان تساوي او تقل عن {{ compared_value }}.

source: This value should not be equal to {{ compared_value }}.
ar: القيمة يجب ان لا تساوي {{ compared_value }}.

# 0eedf91
source: This value should not be identical to {{ compared_value_type }} {{ compared_value }}.
ar: القيمة يجب ان لا تطابق {{ compared_value_type }} {{ compared_value }}.

# 9c3ad0f
source: The image ratio is too big ({{ ratio }}). Allowed maximum ratio is {{ max_ratio }}.
ar: نسبة العرض على الارتفاع للصورة كبيرة جدا ({{ ratio }}). الحد الأقصى للنسبة المسموح به هو {{ max_ratio }}.

# 4376d45
source: The image ratio is too small ({{ ratio }}). Minimum ratio expected is {{ min_ratio }}.
ar: نسبة العرض على الارتفاع للصورة صغيرة جدا ({{ ratio }}). الحد الأدنى للنسبة المسموح به هو {{ max_ratio }}.

source: The image is square ({{ width }}x{{ height }}px). Square images are not allowed.
ar: الصورة مربعة ({{ width }}x{{ height }}px). الصور المربعة غير مسموح بها.

# 1dc128a
source: The image is landscape oriented ({{ width }}x{{ height }}px). Landscape oriented images are not allowed.
ar: الصورة في وضع أفقي ({{ width }}x{{ height }}px). الصور في وضع أفقي غير مسموح بها.

# 9e27714
source: The image is portrait oriented ({{ width }}x{{ height }}px). Portrait oriented images are not allowed.
ar: الصورة في وضع عمودي ({{ width }}x{{ height }}px). الصور في وضع عمودي غير مسموح بها.

source: An empty file is not allowed.
ar: ملف فارغ غير مسموح به.

source: The host could not be resolved.
ar: يتعذر الإتصال بالنطاق.

source: This value does not match the expected {{ charset }} charset.
ar: هذه القيمة غير متطابقة مع صيغة التحويل {{ charset }}.

source: This is not a valid Business Identifier Code (BIC).
ar: هذه القيمة ليست رمز معرّف نشاط تجاري صالح (BIC).

source: Error
ar: خطأ

source: This is not a valid UUID.
ar: هذا ليس UUID صالح.

source: This value should be a multiple of {{ compared_value }}.
ar: هذه القيمة يجب أن تكون مضاعف ل {{ compared_value }}.

source: This Business Identifier Code (BIC) is not associated with IBAN {{ iban }}.
ar: رمز المعرّف نشاط تجاري (BIC) هذا لا يرتبط مع IBAN {{ iban }}.

source: This value should be valid JSON.
ar: هذه القيمة يجب أن تكون صالحة ل JSON.

source: This collection should contain only unique elements.
ar: يجب أن تحتوي هذه المجموعة علي عناصر فريدة فقط.

source: This value should be positive.
ar: يجب أن تكون هذه القيمة موجبة.

source: This value should be either positive or zero.
ar: يجب أن تكون هذه القيمة إما موجبة او صفر.

source: This value should be negative.
ar: يجب أن تكون هذه القيمة سالبة.

source: This value should be either negative or zero.
ar: يجب أن تكون هذه القيمة إما سالبة او صفر.

source: This value is not a valid timezone.
ar: هذه القيمة ليست منطقة زمنية صحيحة.

# 7e27e92
source: This password has been leaked in a data breach, it must not be used. Please use another password.
ar: تم تسريب كلمة المرور هذه في خرق للبيانات، ويجب عدم استخدامها. يرجي استخدام كلمة مرور أخري.

source: This value should be between {{ min }} and {{ max }}.
ar: يجب أن تكون هذه القيمة بين {{ min }} و {{ max }}.

source: This value is not a valid hostname.
ar: هذه القيمة ليست اسم مضيف صالح.

# d165c02
source: The number of elements in this collection should be a multiple of {{ compared_value }}.
ar: يجب أن يكون عدد العناصر في هذه المجموعة مضاعف {{ compared_value }}.

source: This value should satisfy at least one of the following constraints:
ar: يجب أن تستوفي هذه القيمة واحدة من القيود التالية:

source: Each element of this collection should satisfy its own set of constraints.
ar: يجب أن يفي كل عنصر من عناصر هذه المجموعة بمجموعة القيود الخاصة به.

source: This value is not a valid International Securities Identification Number (ISIN).
ar: صالح (ISIN) هذه القيمة ليست رقم تعريف الأوراق المالية الدولي.

source: This form should not contain extra fields.
ar: هذا النموذج يجب الا يحتوى على اى حقول اضافية.

source: The uploaded file was too large. Please try to upload a smaller file.
ar: مساحة الملف المرسل كبيرة. من فضلك حاول ارسال ملف اصغر.

source: The CSRF token is invalid. Please try to resubmit the form.
ar: قيمة رمز الموقع غير صحيحة. من فضلك اعد ارسال النموذج.

source: This value is not a valid HTML5 color.
ar: هذه القيمة ليست لون HTML5 صالحًا.

source: Please enter a valid birthdate.
ar: الرجاء ادخال تاريخ ميلاد صالح.

source: The selected choice is invalid.
ar: الاختيار المحدد غير صالح.

source: The collection is invalid.
ar: المجموعة غير صالحة.

source: Please select a valid color.
ar: الرجاء اختيار لون صالح.

source: Please select a valid country.
ar: الرجاء اختيار بلد صالح.

source: Please select a valid currency.
ar: الرجاء اختيار عملة صالحة.

source: Please choose a valid date interval.
ar: الرجاء اختيار فاصل زمني صالح.

source: Please enter a valid date and time.
ar: الرجاء إدخال تاريخ ووقت صالحين.

source: Please enter a valid date.
ar: الرجاء إدخال تاريخ صالح.

source: Please select a valid file.
ar: الرجاء اختيار ملف صالح.

source: The hidden field is invalid.
ar: الحقل المخفي غير صالح.

source: Please enter an integer.
ar: الرجاء إدخال عدد صحيح.

source: Please select a valid language.
ar: الرجاء اختيار لغة صالحة.

source: Please select a valid locale.
ar: الرجاء اختيار لغة صالحة.

source: Please enter a valid money amount.
ar: الرجاء إدخال مبلغ مالي صالح.

source: Please enter a number.
ar: الرجاء إدخال رقم.

source: The password is invalid.
ar: كلمة المرور غير صحيحة.

source: Please enter a percentage value.
ar: الرجاء إدخال قيمة النسبة المئوية.

source: The values do not match.
ar: القيم لا تتطابق.

source: Please enter a valid time.
ar: الرجاء إدخال وقت صالح.

source: Please select a valid timezone.
ar: الرجاء تحديد منطقة زمنية صالحة.

source: Please enter a valid URL.
ar: أدخل عنوان الرابط صحيح من فضلك.

source: Please enter a valid search term.
ar: الرجاء إدخال مصطلح البحث ساري المفعول.

source: Please provide a valid phone number.
ar: يرجى تقديم رقم هاتف صالح.

source: The checkbox has an invalid value.
ar: خانة الاختيار لها قيمة غير صالحة.

source: Please enter a valid email address.
ar: رجاء قم بإدخال بريد الكتروني صحيح

source: Please select a valid option.
ar: الرجاء تحديد خيار صالح.

source: Please select a valid range.
ar: يرجى تحديد نطاق صالح.

source: Please enter a valid week.
ar: الرجاء إدخال أسبوع صالح.

source: 0d999f2
ar: يجب ان تختار {{ limit }} اختيار على الاقل.|يجب ان تختار {{ limit }} اختيار على الاقل.|يجب ان تختار {{ limit }} اختيارات على الاقل.|يجب ان تختار {{ limit }} اختيار على الاقل.|يجب ان تختار {{ limit }} اختيار على الاقل.|يجب ان تختار {{ limit }} اختيار على الاقل.

source: 1ad411a
ar: الملف كبير جدا ({{ size }} {{ suffix }}).اقصى مساحه مسموح بها ({{ limit }} {{ suffix }}).

source: 30a318d
ar: نوع الملف غير صحيح ({{ type }}). الانواع المسموح بها هى {{ types }}.

source: 0e0c1e1
ar: هذه القيمة طويلة جدا. يجب ان تكون {{ limit }} حرف او اقل.|هذه القيمة طويلة جدا. يجب ان تكون {{ limit }} حرف او اقل.|هذه القيمة طويلة جدا. يجب ان تكون {{ limit }} حروف او اقل.|هذه القيمة طويلة جدا. يجب ان تكون {{ limit }} حرف او اقل.|هذه القيمة طويلة جدا. يجب ان تكون {{ limit }} حرف او اقل.|هذه القيمة طويلة جدا. يجب ان تكون {{ limit }} حرف او اقل.

source: 5188ff9
ar: هذه القيمة قصيرة جدا. يجب ان تكون {{ limit }} حرف او اكثر.|هذه القيمة قصيرة جدا. يجب ان تكون {{ limit }} حرف او اكثر.|هذه القيمة قصيرة جدا. يجب ان تكون {{ limit }} حروف او اكثر.|هذه القيمة قصيرة جدا. يجب ان تكون {{ limit }} حرف او اكثر.|هذه القيمة قصيرة جدا. يجب ان تكون {{ limit }} حرف او اكثر.|هذه القيمة قصيرة جدا. يجب ان تكون {{ limit }} حرف او اكثر.

source: 266051e
ar: عرض الصورة كبير جدا ({{ width }}px). اقصى عرض مسموح به هو{{ max_width }}px.

source: c1c23f9
ar: عرض الصورة صغير جدا ({{ width }}px). اقل عرض مسموح به هو{{ min_width }}px.

source: 9a128f7
ar: طول الصورة كبير جدا ({{ height }}px). اقصى طول مسموح به هو{{ max_height }}px.

source: 8a4cd70
ar: طول الصورة صغير جدا ({{ height }}px). اقل طول مسموح به هو{{ min_height }}px.

source: fd389d6
ar: هذه القيمة يجب ان تحتوى على {{ limit }} حرف فقط.|هذه القيمة يجب ان تحتوى على {{ limit }} حرف فقط.|هذه القيمة يجب ان تحتوى على {{ limit }} حروف فقط.|هذه القيمة يجب ان تحتوى على {{ limit }} حرف فقط.|هذه القيمة يجب ان تحتوى على {{ limit }} حرف فقط.|هذه القيمة يجب ان تحتوى على {{ limit }} حرف فقط.

source: b54c218
ar: هذه المجموعة يجب ان تحتوى على {{ limit }} عنصر او اكثر.|هذه المجموعة يجب ان تحتوى على {{ limit }} عنصر او اكثر.|هذه المجموعة يجب ان تحتوى على {{ limit }} عناصر او اكثر.|هذه المجموعة يجب ان تحتوى على {{ limit }} عنصر او اكثر.|هذه المجموعة يجب ان تحتوى على {{ limit }} عنصر او اكثر.|هذه المجموعة يجب ان تحتوى على {{ limit }} عنصر او اكثر.

source: 949632c
ar: هذه المجموعة يجب ان تحتوى على {{ limit }} عنصر او اقل.|هذه المجموعة يجب ان تحتوى على {{ limit }} عنصر او اقل.|هذه المجموعة يجب ان تحتوى على {{ limit }} عناصر او اقل.|هذه المجموعة يجب ان تحتوى على {{ limit }} عنصر او اقل.|هذه المجموعة يجب ان تحتوى على {{ limit }} عنصر او اقل.|هذه المجموعة يجب ان تحتوى على {{ limit }} عنصر او اقل.

source: e0582dc
ar: هذه المجموعة يجب ان تحتوى على {{ limit }} عنصر فقط.|هذه المجموعة يجب ان تحتوى على {{ limit }} عنصر فقط.|هذه المجموعة يجب ان تحتوى على {{ limit }} عناصر فقط.|هذه المجموعة يجب ان تحتوى على {{ limit }} عنصر فقط.|هذه المجموعة يجب ان تحتوى على {{ limit }} عنصر فقط.|هذه المجموعة يجب ان تحتوى على {{ limit }} عنصر فقط.

source: 0eedf91
ar: القيمة يجب ان لا تطابق {{ compared_value_type }} {{ compared_value }}.

source: 9c3ad0f
ar: نسبة العرض على الارتفاع للصورة كبيرة جدا ({{ ratio }}). الحد الأقصى للنسبة المسموح به هو {{ max_ratio }}.

source: 4376d45
ar: نسبة العرض على الارتفاع للصورة صغيرة جدا ({{ ratio }}). الحد الأدنى للنسبة المسموح به هو {{ max_ratio }}.

source: 1dc128a
ar: الصورة في وضع أفقي ({{ width }}x{{ height }}px). الصور في وضع أفقي غير مسموح بها.

source: 9e27714
ar: الصورة في وضع عمودي ({{ width }}x{{ height }}px). الصور في وضع عمودي غير مسموح بها.

source: 7e27e92
ar: تم تسريب كلمة المرور هذه في خرق للبيانات، ويجب عدم استخدامها. يرجي استخدام كلمة مرور أخري.

source: d165c02
ar: يجب أن يكون عدد العناصر في هذه المجموعة مضاعف {{ compared_value }}.
